const state = {
  input: {
    // 1 螺栓预紧力
    // 1-1 压紧密封垫圈所需的力Fj
    Di: "",
    Do: "",
    y: "",
    // 1-2 保证垫片密封要求的力FS(P)
    P_1_2: "", // 系统压力
    Mf: "",
    Fa: "",
    m: "",
    Ec: "",
    Eh: "",
    Ps: "",
    FT: "",
    // 1-3 螺栓紧固力矩
    d: "",
    S: "",
    P_1_3: "", // 螺母平头直径
    f: "",
    f_: "",
    n: "",
    PV: "",

    // 2 螺栓校核
    SB: "", // 螺栓实际根部截面积，1-3的输出
    SB_is_calculated: true,
    material_type: "",
    // 2-1 设计工况下的校核
    Pc: "",
    T_2_1: "", // 设计温度
    S_2_1: "", // 螺栓材料在设计温度下的许用应力
    S_2_1_is_calculated: true,
    // 2-2 运行工况下的校核
    Sy: "",
    T_2_2: "", // 运行温度
    S_2_2: "", // 螺栓材料在运行温度下的许用应力
    S_2_2_is_calculated: true,
    // 2-3 试验工况下的校核
    Pe: "",
  },

  output: {
    // 1 螺栓预紧力
    // 1-1 压紧密封垫圈所需的力Fj
    Dj: "--",
    Fj: "--",
    // 1-2 保证垫片密封要求的力FS(P)
    Peq: "--",
    FF: "--",
    FM: "--",
    FS: "--",
    FS0: "--",
    FS_: "--",
    FS0_: "--",
    FSi: "--",
    // 1-3 螺栓紧固力矩
    r: "--",
    Rma: "--",
    SB: "--",
    CS: "--",

    // 2 螺栓校核
    // 2-1 设计工况下的校核
    FSPc: "--",
    SA_2_1: "--", // 设计工况下所需的螺栓最小截面积
    check_result_2_1: "--", // 设计工况下的校核结果
    // 2-2 运行工况下的校核
    SA_2_2: "--", // 运行工况下所需的螺栓最小截面积
    check_result_2_2: "--", // 运行工况下的校核结果
    // 2-3 试验工况下的校核
    FSPe: "--",
    SA_2_3: "--", // 试验工况下所需的螺栓最小截面积
    check_result_2_3: "--", // 试验工况下的校核结果

  }
}

const mutations = {}

const actions = {}

export default {
  namespaced: true,
  state,
  mutations,
  actions,
}
